In [1]:
import pandas as pd 

# 데이터 생성 
data = {
    'Name':['rose','jennie','kyu'],
    'Age':[20,20,20],
    'City':['seoul','busan','tokyo']
}

df = pd.DataFrame(data)

df

     Name  Age   City
0    rose   20  seoul
1  jennie   20  busan
2     kyu   20  tokyo

In [ ]:
df.loc[0] # 0번째 행 전체 출력

Name     rose
Age        20
City    seoul
Name: 0, dtype: object

In [4]:
df.loc[:,'Name'] # Name 열 전체 선택

0      rose
1    jennie
2       kyu
Name: Name, dtype: object

In [5]:
df.iloc[1]

Name    jennie
Age         20
City     busan
Name: 1, dtype: object

In [6]:
df.iloc[0:1,0:2]

   Name  Age
0  rose   20

In [16]:
df.loc[0:1, 'Name':'Name']

     Name
0    rose
1  jennie

In [18]:
import pandas as pd

# 데이터 생성 (예시)
data = {
    'Artist': ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H'],
    'Album': ['A1', 'B1', 'C1', 'D1', 'E1', 'F1', 'G1', 'H1'],
    'Year': [2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007],
    'Rating': [5, 4, 3, 2, 5, 4, 3, 2],
    'Genre': ['Pop', 'Jazz', 'Rock', 'Blues', 'Folk', 'Hip-Hop', 'Disco', 'Classical']
}

df = pd.DataFrame(data)
df

  Artist Album  Year  Rating      Genre
0      A    A1  2000       5        Pop
1      B    B1  2001       4       Jazz
2      C    C1  2002       3       Rock
3      D    D1  2003       2      Blues
4      E    E1  2004       5       Folk
5      F    F1  2005       4    Hip-Hop
6      G    G1  2006       3      Disco
7      H    H1  2007       2  Classical

In [ ]:
df.iloc[6,4]

# df.iloc[행번호, 열번호]
# df.loc[행라벨, 'Genre']

'Disco'